[
  {
    "id": "riven-tides",
    "title": "Riven Tides Update",
    "status": "confirmed",
    "startDate": "2026-04-01",
    "endDate": "2026-04-30",
    "teaser": "New ground. A major ARC presence. The season finale hits in April and it is bringing something big.",
    "summary": "Riven Tides is the fourth and final Escalation update, planned for April 2026. It is expected to feature a new or heavily reworked map, potentially coastal themed, and a significant new high-level ARC boss. This is the culmination of the Escalation season narrative arc.",
    "howItWorks": [
      "New or heavily updated map expected",
      "Major new ARC boss encounter",
      "Culmination of Escalation season storyline",
      "Full details not yet revealed"
    ],
    "rewards": [
      "New map-specific loot tables",
      "Boss-specific drops",
      "Escalation season finale rewards",
      "New Raider Deck expected"
    ],
    "raiderImpact": [
      "Solo: Boss content historically requires squad play",
      "Duo: May be viable depending on boss mechanics",
      "Trio: Almost certainly the intended squad size for boss content"
    ],
    "sources": [
      {
        "label": "Escalation Roadmap",
        "url": "https://arcraiders.com/news/roadmap-january-april-2026"
      }
    ],
    "lastUpdated": "2026-01-23"
  },
  {
    "id": "flashpoint",
    "title": "Flashpoint Update",
    "status": "confirmed",
    "startDate": "2026-03-01",
    "endDate": "2026-03-31",
    "teaser": "Lightning on the horizon. New threats. The Scrappy might actually be useful after this one.",
    "summary": "Flashpoint is the third Escalation update, planned for March 2026. It introduces lightning hazards as a new environmental threat, additional enemy types, and meaningful improvements to the Scrappy companion. Details remain limited but the roadmap confirms it as a major content drop.",
    "howItWorks": [
      "New lightning hazard environmental condition",
      "Additional ARC enemy types",
      "Scrappy companion improvements and new functionality",
      "Expected to continue monthly Raider Deck cadence"
    ],
    "rewards": [
      "New Raider Deck expected",
      "Lightning hazard-specific loot",
      "Scrappy companion upgrades",
      "New enemy drop tables"
    ],
    "raiderImpact": [
      "Solo: Lightning hazards add another survival variable to manage",
      "Duo: Scrappy improvements may reduce the need for a third",
      "Trio: New enemies likely scale to squad size"
    ],
    "sources": [
      {
        "label": "Escalation Roadmap",
        "url": "https://arcraiders.com/news/roadmap-january-april-2026"
      }
    ],
    "lastUpdated": "2026-01-23"
  },
  {
    "id": "expedition-2",
    "title": "Second Expedition",
    "status": "confirmed",
    "startDate": "2026-02-25",
    "endDate": "2026-03-01",
    "teaser": "The tunnels out of Speranza open again. Fresh start, new bonuses, but everything you built gets left behind. Choose wisely.",
    "summary": "The second Expedition is the seasonal character reset. Sign-ups open February 25 and departure is March 1. Stash value requirement for max rewards has been lowered to 3 million Coins (down from 5 million). Catch-up mechanic lets Raiders who missed first Expedition skill points recover them at a 50% discount.",
    "howItWorks": [
      "Sign-up opens February 25, departure March 1",
      "Stash value requirement lowered to 3M Coins for max 5 Skill Points",
      "Catch-up mechanic: missed Skill Points from Expedition 1 available at 50% cost",
      "Permanent: cosmetics, Raider Tokens, Trophy Display, Codex, Raider Deck progress",
      "Reset: level, stash, inventory, loadouts, skill tree",
      "Patchwork outfit evolves with new toggles and color options",
      "Buffs stack for consecutive departures but reset if you skip one"
    ],
    "rewards": [
      "Up to 5 Skill Points for 3M stash value",
      "12 to 24 stash spaces permanent unlock",
      "Evolved Patchwork outfit with new customization",
      "New Scrappy outfit",
      "Expedition Indicator icon upgrade",
      "Stacking buffs for consecutive departures"
    ],
    "raiderImpact": [
      "Solo: Grind to 3M is achievable solo but tight on time, start stacking now",
      "Duo: Split loot routes to hit stash value faster",
      "Trio: Most efficient for speed-running the coin requirement before March 1"
    ],
    "sources": [
      {
        "label": "Expedition Details",
        "url": "https://arcraiders.com/news/second-expedition-rewards-and-requirements"
      }
    ],
    "lastUpdated": "2026-02-05"
  },
  {
    "id": "steam-arc-raiders-is-getting-a-hurricane-map-condition-t",
    "title": "Arc Raiders is getting a hurricane map condition that will hasten your steps and blow grenades back in your face",
    "status": "confirmed",
    "startDate": "2026-02-20",
    "endDate": null,
    "teaser": "Embark are continuing their meteorological experiments in extraction shooter Arc Raiders with a rousing injection of wind. There’s a hurricane comi...",
    "summary": "Embark are continuing their meteorological experiments in extraction shooter Arc Raiders with a rousing injection of wind. There’s a hurricane coming to the game on February 24th, a new map condition that limits visibility, degrades shields, impedes movement, and makes you suck even more at shooting things. Still, this stormcloud has a few silver linings. With the gale at your back, you’ll naturally move a lot faster. Also, you may find it easier to avoid detection in the open if you disable your shield. Read more",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1825093633187723"
      }
    ],
    "lastUpdated": "2026-02-20"
  },
  {
    "id": "shrouded-sky",
    "title": "Shrouded Sky Update",
    "status": "confirmed",
    "startDate": "2026-02-17",
    "endDate": "2026-03-15",
    "teaser": "Wind conditions incoming. New ARC threats spotted on the perimeter. Topside is about to get a lot less predictable.",
    "summary": "Shrouded Sky is the second major Escalation update. It introduces a new gusty wind map condition affecting visibility and movement, a new ARC enemy type, a new Raider Deck with cosmetics and Raider Tokens, and at least one existing map receiving a significant update.",
    "howItWorks": [
      "New gusty wind map condition reduces visibility and affects movement",
      "New ARC enemy type being introduced",
      "New Raider Deck with gadgets, cosmetics, and Raider Tokens",
      "At least one existing map receives a gameplay-affecting update",
      "Second Expedition window opens for sign-ups"
    ],
    "rewards": [
      "New Raider Deck progression rewards",
      "New ARC enemy-specific loot drops",
      "Updated map loot tables",
      "Expedition sign-up bonuses"
    ],
    "raiderImpact": [
      "Solo: Wind conditions make solo navigation harder, plan routes carefully",
      "Duo: One spots through the wind while the other moves, strong synergy",
      "Trio: New enemy likely requires coordinated fire, trio recommended"
    ],
    "sources": [
      {
        "label": "Escalation Roadmap",
        "url": "https://arcraiders.com/news/roadmap-january-april-2026"
      },
      {
        "label": "Shrouded Sky Info",
        "url": "https://blast.tv/gaming/news/arc-raiders-info-so-far-on-shrouded-sky-update"
      }
    ],
    "lastUpdated": "2026-02-05"
  },
  {
    "id": "shared-watch",
    "title": "Shared Watch Event",
    "status": "confirmed",
    "startDate": "2026-02-10",
    "endDate": "2026-02-24",
    "teaser": "For two weeks, raiders point barrels at machines instead of each other. Merits flow for those who cooperate.",
    "summary": "The Shared Watch is a PvE-focused live event celebrating cooperation against the ARC. Players earn Merits by destroying, assisting, and damaging ARC machines. No Merits are earned from PvP encounters during this window. Bring a friend or bring a stranger, but bring enough ammo.",
    "howItWorks": [
      "Earn Merits from destroying, assisting, and damaging ARC machines",
      "No Merits earned from PvP kills during the event window",
      "Bring a squad or matchmake with strangers",
      "Merit thresholds unlock tiered event rewards"
    ],
    "rewards": [
      "Tiered Shared Watch event rewards based on Merit thresholds",
      "Exclusive Shared Watch cosmetics",
      "Event-specific loot tied to PvE performance"
    ],
    "raiderImpact": [
      "Solo: Viable, focus on ARC farming in less contested zones",
      "Duo: Strong PvE output, can cover more ground",
      "Trio: Maximum Merit generation, ideal for hitting top reward tiers"
    ],
    "sources": [
      {
        "label": "Patch Notes 1.15.0",
        "url": "https://arcraiders.com/news/patch-notes-1-15-0"
      }
    ],
    "lastUpdated": "2026-02-10"
  },
  {
    "id": "cold-snap",
    "title": "Cold Snap Returns",
    "status": "confirmed",
    "startDate": "2026-02-10",
    "endDate": "2026-02-24",
    "teaser": "Winter is not done with the Rust Belt. Frostbite will end your run if you do not find shelter, but the loot is worth the risk.",
    "summary": "The Cold Snap map condition is back in rotation on outdoor maps. Frostbite damage will cut your topside trip short if you do not seek shelter, but braving the tundra means increased loot value. Candleberries are collectible but no longer event-tied. Snowballs are throwable.",
    "howItWorks": [
      "Cold Snap active on outdoor maps in current rotation",
      "Frostbite deals damage over time if you stay exposed",
      "Seek shelter periodically to reset frostbite buildup",
      "Increased loot value in Cold Snap zones as risk reward",
      "Candleberries collectible, snowballs throwable"
    ],
    "rewards": [
      "Increased loot value on Cold Snap maps",
      "Candleberry collection",
      "High-risk high-reward extraction runs"
    ],
    "raiderImpact": [
      "Solo: Dangerous, frostbite management is harder without a squad watching timers",
      "Duo: One watches exposure while the other loots",
      "Trio: Can rotate shelter duty and maximize extraction hauls"
    ],
    "sources": [
      {
        "label": "Patch Notes 1.15.0",
        "url": "https://arcraiders.com/news/patch-notes-1-15-0"
      }
    ],
    "lastUpdated": "2026-02-10"
  },
  {
    "id": "feb-update",
    "title": "February Update 1.15.0",
    "status": "confirmed",
    "startDate": "2026-02-10",
    "endDate": "2026-03-09",
    "teaser": "New patch dropped. Fixes, balance passes, and two new cosmetic sets for those who like looking good while getting shot at.",
    "summary": "The February Update brings the Shared Watch event, Cold Snap return, two new cosmetic sets (Vulpine and Slugger), and a round of bug fixes and balance changes. Trailblazer Grenade no longer deals damage through walls. Several known issues remain under investigation.",
    "howItWorks": [
      "Shared Watch event and Cold Snap map condition now active",
      "Vulpine and Slugger cosmetic sets available",
      "Trailblazer Grenade explosion no longer pierces walls",
      "Reconnection improvements after disconnects",
      "Trials objective reward timeout fix applied"
    ],
    "rewards": [
      "Vulpine cosmetic set",
      "Slugger cosmetic set",
      "Shared Watch event rewards"
    ],
    "raiderImpact": [
      "Solo: Trailblazer nerf affects grenade-dependent solo builds",
      "Duo: Reconnection fix means fewer lost runs to disconnects",
      "Trio: Trials reward fix means earned rewards actually grant properly"
    ],
    "sources": [
      {
        "label": "Patch Notes 1.15.0",
        "url": "https://arcraiders.com/news/patch-notes-1-15-0"
      }
    ],
    "lastUpdated": "2026-02-10"
  },
  {
    "id": "steam-embark-would-like-you-all-to-play-nice-in-arc-raid",
    "title": "Embark would like you all to play nice in Arc Raiders' temporary PvE event Shared Watch, which starts today",
    "status": "confirmed",
    "startDate": "2026-02-10",
    "endDate": null,
    "teaser": "The single most offputting thing about a game like Arc Raiders, i.e. an extraction shooter, is that every single other person you meet in-game is S...",
    "summary": "The single most offputting thing about a game like Arc Raiders, i.e. an extraction shooter, is that every single other person you meet in-game is Schrödinger's asshole. They could be a friend who you share a story or some loot with, or they could mercilessly gun you down at the drop of a hat. It's certainly not for everyone, but in the game's latest update, a new PvE event has arrived encouraging everyone to walk hand in hand together to defeat those big bad bots. Read more",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1823825466509160"
      }
    ],
    "lastUpdated": "2026-02-10"
  },
  {
    "id": "steam-don-t-like-how-often-map-conditions-rotate-in-arc-",
    "title": "Don't like how often map conditions rotate in Arc Raiders? Sorry, but the devs say \"that most likely won't change\"",
    "status": "confirmed",
    "startDate": "2026-02-07",
    "endDate": null,
    "teaser": "For all of their faults (the list may be endless), the interesting thing about live service games, when done well anyway, is the way they can chang...",
    "summary": "For all of their faults (the list may be endless), the interesting thing about live service games, when done well anyway, is the way they can change from day to day. There's an actual living quality to them that, even if I'll always prefer them, a singleplayer game can't capture as well. One such game that can change quite drastically is Arc Raiders, with its varying map conditions and events, swapping in and out at the whims of its developers. This rotation isn't something universally loved, but CEO Patrick Söderlund has said that they're here to stay. Read more",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1823825466502702"
      }
    ],
    "lastUpdated": "2026-02-07"
  },
  {
    "id": "steam-embark-smooth-over-arc-raiders-expedition-rough-pa",
    "title": "Embark smooth over Arc Raiders' Expedition rough patches with a cheaper entry point for its second bout",
    "status": "confirmed",
    "startDate": "2026-02-05",
    "endDate": null,
    "teaser": "Ah, live service games. You put out a new feature, everybody complains about one thing or another, you say something like \"we've heard your feedbac...",
    "summary": "Ah, live service games. You put out a new feature, everybody complains about one thing or another, you say something like \"we've heard your feedback\" and change it the next time around. This, almost word for word, is exactly what's happened with Arc Raiders' and its impending second Expedition, the details of which have been outlined in a handy blog post from developer Embark. Read more",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1823825466497836"
      }
    ],
    "lastUpdated": "2026-02-05"
  },
  {
    "id": "steam-arc-raiders-and-the-finals-hit-by-extensive-co-ord",
    "title": "Arc Raiders and The Finals hit by \"extensive, co-ordinated DDoS attacks\", according to developers Embark",
    "status": "confirmed",
    "startDate": "2026-01-28",
    "endDate": null,
    "teaser": "Arc Raiders and The Finals developers Embark have warned players that the two shooters have been hit by \"extensive, co-ordinated DDoS (Distributed ...",
    "summary": "Arc Raiders and The Finals developers Embark have warned players that the two shooters have been hit by \"extensive, co-ordinated DDoS (Distributed Denial-of-Service) attacks\". The studio said these attacks were \"ongoing\" in a post put out at 11:59 AM GMT today. Read more",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1823191198600501"
      }
    ],
    "lastUpdated": "2026-01-28"
  },
  {
    "id": "steam-arc-raiders-update-rips-out-one-of-the-game-s-most",
    "title": "Arc Raiders update rips out one of the game's most maddening puzzles",
    "status": "confirmed",
    "startDate": "2026-01-28",
    "endDate": null,
    "teaser": "Arc Raiders has a new Headwinds game update that, amongst many other things, removes an extravagantly drawn-out puzzle from the game’s Buried City ...",
    "summary": "Arc Raiders has a new Headwinds game update that, amongst many other things, removes an extravagantly drawn-out puzzle from the game’s Buried City map. Introduced in December, the puzzle in question saw people tracking down and pushing 15 buttons in a certain order to unlock a secret chamber containing an actual, strummable guitar. As of this updating, you’ll now be able to buy that guitar at Shani’s, like a millionaire tourist paying to be flown to the top of Mount Everest. I regard this as a dilution of the game, on paper, but I am not one of the players who’ve driven themselves crackers ...",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/rps/1823191198599903"
      }
    ],
    "lastUpdated": "2026-01-28"
  },
  {
    "id": "headwinds",
    "title": "Headwinds Update",
    "status": "confirmed",
    "startDate": "2026-01-27",
    "endDate": "2026-02-09",
    "teaser": "The ice melted. The survivors thawed. Solo vs Squads is live and the Trophy Display gives hunters something to mount.",
    "summary": "Headwinds was the first Escalation update. It introduced Solo vs Squads matchmaking for level 40+ Raiders, the Trophy Display player project for ARC hunting, a new map condition, and two new cosmetic sets. Extra XP is awarded for entering squad lobbies as a solo.",
    "howItWorks": [
      "Solo vs Squads matchmaking unlocked at level 40+",
      "Extra XP bonus for solo players entering squad lobbies",
      "Trophy Display project: hunt ARC for sport, mount trophies",
      "New map condition introduced",
      "Two new cosmetic sets released"
    ],
    "rewards": [
      "Solo vs Squads XP bonus",
      "Trophy Display progression rewards",
      "Sandwalker cosmetic set",
      "New map condition loot tables"
    ],
    "raiderImpact": [
      "Solo: Built for you, Solo vs Squads is the headline feature",
      "Duo: Not directly affected, but Trophy Display is fun co-op content",
      "Trio: Standard squad play unchanged"
    ],
    "sources": [
      {
        "label": "Headwinds Announcement",
        "url": "https://arcraiders.com/news/headwinds-content-update"
      }
    ],
    "lastUpdated": "2026-01-27"
  },
  {
    "id": "steam-arc-raiders-latest-update-adds-a-solo-vs-squads-mo",
    "title": "ARC Raiders latest update adds a Solo vs Squads mode, long-term Trophy Display project and lots more",
    "status": "confirmed",
    "startDate": "2026-01-27",
    "endDate": null,
    "teaser": "While it may not yet be the extra content many players are hoping for, the latest ARC Raiders update overall sounds pretty great actually to pull m...",
    "summary": "While it may not yet be the extra content many players are hoping for, the latest ARC Raiders update overall sounds pretty great actually to pull me back in. Read the full article here: https://www.gamingonlinux.com/2026/01/arc-raiders-latest-update-adds-a-solo-vs-squads-mode-long-term-trophy-display-project-and-lots-more/",
    "howItWorks": [
      "Details sourced from GamingOnLinux news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "GamingOnLinux",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/GamingOnLinux/1822556746168754"
      }
    ],
    "lastUpdated": "2026-01-27"
  },
  {
    "id": "steam-arc-raiders-finally-reveals-early-2026-roadmap-but",
    "title": "Arc Raiders finally reveals early 2026 roadmap, but we’re not getting a new map for a while",
    "status": "confirmed",
    "startDate": "2026-01-26",
    "endDate": null,
    "teaser": "After weeks of waiting, Arc Raiders developer Embark has officially unveiled the first few months of the game’s 2026 roadmap. The plan is split int...",
    "summary": "After weeks of waiting, Arc Raiders developer Embark has officially unveiled the first few months of the game’s 2026 roadmap. The plan is split into four months, covering January to April, collectively dubbed Escalation. Read more",
    "howItWorks": [
      "Details sourced from VG247 news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "VG247",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/1822556746167128"
      }
    ],
    "lastUpdated": "2026-01-26"
  },
  {
    "id": "steam-arc-raiders-has-a-new-content-filled-roadmap-for-e",
    "title": "ARC Raiders has a new content-filled roadmap for early 2026",
    "status": "confirmed",
    "startDate": "2026-01-24",
    "endDate": null,
    "teaser": "Embark Studios have released a fresh roadmap for ARC Raiders covering the next few months, and it sounds like it's adding a whole lot to the game. ...",
    "summary": "Embark Studios have released a fresh roadmap for ARC Raiders covering the next few months, and it sounds like it's adding a whole lot to the game. Read the full article here: https://www.gamingonlinux.com/2026/01/arc-raiders-has-a-new-content-filled-roadmap-for-early-2026/",
    "howItWorks": [
      "Details sourced from GamingOnLinux news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "GamingOnLinux",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/GamingOnLinux/1822556746163793"
      }
    ],
    "lastUpdated": "2026-01-24"
  },
  {
    "id": "steam-they-ll-figure-out-how-to-get-out-of-there-eventua",
    "title": "\"They'll figure out how to get out of there eventually\" – Arc Raiders' latest enemy won't stick to Stella Montis",
    "status": "confirmed",
    "startDate": "2026-01-21",
    "endDate": null,
    "teaser": "As someone of a nervous disposition, I am not a fan of the Shredder, one of the latest enemies added to Arc Raiders. First appearing after November...",
    "summary": "As someone of a nervous disposition, I am not a fan of the Shredder, one of the latest enemies added to Arc Raiders. First appearing after November's North Line update, these floating bollards buzz about the halls and corridors of the mountainside facility, Stella Montis. Cross their path and they emit a mechanical shriek before releasing an explosive wave of shrapnel. Anyone caught in the blast is cut to shribbons. Currently, like a Dalek left at the top of a staircase, Shredders haven't found a way down the mountain and out into the world. So, if I want to avoid being screamed at and evis...",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1822556746157275"
      }
    ],
    "lastUpdated": "2026-01-21"
  },
  {
    "id": "steam-arc-raiders-hits-over-12-4m-sales-new-patch-out-wi",
    "title": "ARC Raiders hits over 12.4M sales - new patch out with weapon nerfs, a free gift and a darker Stella Montis",
    "status": "confirmed",
    "startDate": "2026-01-13",
    "endDate": null,
    "teaser": "ARC Raiders has been a huge success for Nexon / Embark Studios with 12.4 million sales, and it seems sales are actually speeding up. Oh, and a new ...",
    "summary": "ARC Raiders has been a huge success for Nexon / Embark Studios with 12.4 million sales, and it seems sales are actually speeding up. Oh, and a new patch is out. Read the full article here: https://www.gamingonlinux.com/2026/01/arc-raiders-hits-over-12-4m-sales-new-patch-out-with-weapon-nerfs-a-free-gift-and-a-darker-stella-montis/",
    "howItWorks": [
      "Details sourced from GamingOnLinux news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "GamingOnLinux",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/GamingOnLinux/1821288646587961"
      }
    ],
    "lastUpdated": "2026-01-13"
  },
  {
    "id": "steam-turns-out-you-have-helldivers-2-to-thank-for-arc-r",
    "title": "Turns out you have Helldivers 2 to thank for Arc Raiders moving away from a free-to-play model",
    "status": "confirmed",
    "startDate": "2026-01-07",
    "endDate": null,
    "teaser": "A few years ago, it would have been pretty easy to imagine Helldivers 2 releasing as a free-to-play game. It is a live service game after all, most...",
    "summary": "A few years ago, it would have been pretty easy to imagine Helldivers 2 releasing as a free-to-play game. It is a live service game after all, most of those are free-to-play because studios want to reduce the barrier to entry. Instead, it launched as a paid-for, $40 game, a far cry from free, but not the $80-$100 releases we're seeing more and more of. And it's because Arrowhead made the decision to do so that Arc Raiders developer Embark did the exact same thing for their own shooter. Read more",
    "howItWorks": [
      "Details sourced from Rock, Paper, Shotgun news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "Rock, Paper, Shotgun",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/Rock, Paper, Shotgun/1821288646577175"
      }
    ],
    "lastUpdated": "2026-01-07"
  },
  {
    "id": "escalation-roadmap",
    "title": "Escalation Season Roadmap",
    "status": "confirmed",
    "startDate": "2026-01-01",
    "endDate": "2026-04-30",
    "teaser": "Four months. Four major updates. The Rust Belt is getting worse before it gets better.",
    "summary": "The Escalation season runs January through April 2026 with four major content drops: Headwinds (Jan), Shrouded Sky (Feb), Flashpoint (Mar), and Riven Tides (Apr). Each update brings new enemies, map conditions, and gear. Monthly content cadence confirmed by Embark Studios.",
    "howItWorks": [
      "Headwinds (January): Solo vs Squads matchmaking for level 40+, Trophy Display project, new map condition",
      "Shrouded Sky (February): New gusty wind map condition, new ARC enemy type, new Raider Deck",
      "Flashpoint (March): Lightning hazards, additional enemies, Scrappy companion improvements",
      "Riven Tides (April): New or heavily updated map, new high-level ARC boss"
    ],
    "rewards": [
      "Monthly Raider Deck progression tracks",
      "New cosmetic sets with each update",
      "New enemy-specific loot tables",
      "Season-long progression rewards"
    ],
    "raiderImpact": [
      "Solo: Headwinds Solo vs Squads mode is built for you",
      "Duo: Solid through all four updates",
      "Trio: Riven Tides boss content likely tuned for full squads"
    ],
    "sources": [
      {
        "label": "Official Roadmap",
        "url": "https://arcraiders.com/news/roadmap-january-april-2026"
      }
    ],
    "lastUpdated": "2026-01-23"
  },
  {
    "id": "steam-arc-raiders-gets-a-huge-v1-7-0-free-update-with-a-",
    "title": "ARC Raiders gets a huge v1.7.0 free update with a new map condition, new event, skill tree resets and more",
    "status": "confirmed",
    "startDate": "2025-12-16",
    "endDate": null,
    "teaser": "Embark Games have been cooking, with ARC Raiders v1.7.0 out now that brings quite a lot to the popular extraction shooter - so time for another run...",
    "summary": "Embark Games have been cooking, with ARC Raiders v1.7.0 out now that brings quite a lot to the popular extraction shooter - so time for another run. Read the full article here: https://www.gamingonlinux.com/2025/12/arc-raiders-gets-a-huge-v1-7-0-free-update-with-a-new-map-condition-new-event-skill-tree-resets-and-more/",
    "howItWorks": [
      "Details sourced from GamingOnLinux news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "GamingOnLinux",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/GamingOnLinux/1818752592135677"
      }
    ],
    "lastUpdated": "2025-12-16"
  },
  {
    "id": "steam-arc-raiders-latest-patch-adds-two-of-the-most-requ",
    "title": "Arc Raiders' latest patch adds two of the most requested features, but kills Cred hoarding",
    "status": "confirmed",
    "startDate": "2025-12-16",
    "endDate": null,
    "teaser": "Embark has just rolled out patch 1.7.0 for Arc Raiders players everywhere. This is a significant patch for the extraction shooter for a number of r...",
    "summary": "Embark has just rolled out patch 1.7.0 for Arc Raiders players everywhere. This is a significant patch for the extraction shooter for a number of reasons, not least of which because it kicks off a series of events under the Cold Snap banner, which introduces a new conditions to the game’s maps. Read more",
    "howItWorks": [
      "Details sourced from VG247 news feed",
      "Check the source link for full information"
    ],
    "rewards": [
      "See official announcement for full details"
    ],
    "raiderImpact": [
      "Solo: Check source for gameplay impact",
      "Duo: Check source for gameplay impact",
      "Trio: Check source for gameplay impact"
    ],
    "sources": [
      {
        "label": "VG247",
        "url": "https://steamstore-a.akamaihd.net/news/externalpost/VG247/1818752592136630"
      }
    ],
    "lastUpdated": "2025-12-16"
  },
  {
    "id": "shrouded-sky-timing",
    "title": "Shrouded Sky Drop Date",
    "status": "unconfirmed",
    "startDate": null,
    "endDate": null,
    "rumoredWindow": "Week of February 17, 2026",
    "teaser": "Community is split on when the wind picks up. Some say the 10th, others the 17th. Nothing from Embark yet.",
    "summary": "The ARC Raiders community is actively speculating on the exact release date for the Shrouded Sky update. Reddit threads show most players expecting a mid-to-late February drop, with February 17 being the most common prediction. Embark has not confirmed a specific date beyond February.",
    "howItWorks": [
      "Embark confirmed Shrouded Sky for February but no exact date",
      "Community consensus leans toward February 17 based on past update cadence",
      "Previous updates dropped on Mondays and Tuesdays",
      "Some datamine activity suggests content is already staged"
    ],
    "rewards": [
      "N/A until update drops"
    ],
    "raiderImpact": [
      "Solo: Use the wait to stack coins for Expedition 2",
      "Duo: Farm Cold Snap while it lasts",
      "Trio: Finish Shared Watch Merit grind before rotation changes"
    ],
    "sources": [
      {
        "label": "Reddit Discussion",
        "url": "https://www.reddit.com/r/ArcRaiders/"
      },
      {
        "label": "Community Speculation",
        "url": "https://www.reddit.com/r/ArcRaiders/"
      }
    ],
    "lastUpdated": "2026-02-08"
  },
  {
    "id": "escalation-narrative",
    "title": "Escalation Endgame",
    "status": "unconfirmed",
    "startDate": null,
    "endDate": null,
    "rumoredWindow": "April 2026",
    "teaser": "The roadmap says the scale of the impending escalation remains unknown. Shani is worried. That should worry you.",
    "summary": "Official roadmap language hints at a larger narrative event building across the Escalation season. Embark wrote that no one holds all the pieces and the scale remains unknown. Community theorists believe the four monthly updates are building toward a major ARC incursion event in April, possibly tied to Riven Tides.",
    "howItWorks": [
      "Roadmap references an impending escalation with unknown scale",
      "Each monthly update appears to increase ARC threat level",
      "Shani character mentioned as being troubled by increased ARC presence",
      "Possible culmination event during or after Riven Tides"
    ],
    "rewards": [
      "Unknown, speculative"
    ],
    "raiderImpact": [
      "Solo: Keep leveling, whatever is coming will test you",
      "Duo: Build synergy now for what may be endgame content",
      "Trio: If a major incursion event drops, full squads will be essential"
    ],
    "sources": [
      {
        "label": "Roadmap Language",
        "url": "https://arcraiders.com/news/roadmap-january-april-2026"
      }
    ],
    "lastUpdated": "2026-01-23"
  }
]